[
  {
    "id": "01",
    "name": "FrontEnd Development",
    "image": "https://miro.medium.com/max/500/0*js0Bfs5IxbjMkQQo.png",
    "details": "A front-end developer builds the front-end portion of websites and web applications—that is, the part that users actually see and interact with. A front-end developer creates websites and applications using web languages such as HTML, CSS, and JavaScript that allow users to access and interact with the site or app."
  },
  {
    "id": "02",
    "name": "BackEnd Development",
    "image": "https://miro.medium.com/max/1200/1*G48L33n3M7FXze_kturcyQ.jpeg",
    "details": "Back-end development means working on server-side software, which focuses on everything you can't see on a website. Back-end developers ensure the website performs correctly, focusing on databases, back-end logic, application programming interface (APIs), architecture, and servers."
  },
  {
    "id": "03",
    "name": "App Development",
    "image": "https://miro.medium.com/max/800/1*8pVdscPZ5UpPRkASvxPZuQ.jpeg",
    "details": "Mobile application development is the process of creating software applications that run on a mobile device, and a typical mobile application utilizes a network connection to work with remote computing resources."
  },
  {
    "id": "04",
    "name": "Machine Learning",
    "image": "https://miro.medium.com/max/1400/0*ZD_0t2oRV-vxiP61.png",
    "details": "Machine learning is a branch of artificial intelligence (AI) and computer science which focuses on the use of data and algorithms to imitate the way that humans learn, gradually improving its accuracy."
  },
  {
    "id": "05",
    "name": "Blockchain Dev.",
    "image": "https://miro.medium.com/max/1200/1*eyc8JQm1-tiGx8QxDgYwkw.png",
    "details": "A blockchain is a decentralized ledger of all transactions across a peer-to-peer network. Using this technology, participants can confirm transactions without a need for a central clearing authority. Potential applications can include fund transfers, settling trades, voting and many other issues."
  },
  {
    "id": "06",
    "name": "UI/UX Design",
    "image": "https://miro.medium.com/max/1050/1*hp-yfKsmzsj711iLbM8eEw.jpeg",
    "details": "User interface (UI) design refers to the aesthetic elements by which people interact with a product, such as buttons, icons, menu bars, typography, colors, and more. User experience (UX) design refers to the experience a user has when interacting with a product."
  }
]
